# #샾은 주석문으로 컴퓨터는 해석하지 않습니다.
# - 작업자를 위해서 쓰는 코멘트

# R의 기본 실행 방법
# - 콘트롤 + 엔터: 다음 실행할 수 있는 라인으로 이동
# - 알트 + 엔터: 실행하고 해당 라인에 머물기

print('Hello')


# R에서 출력을 하는 2가지 방법
# - 1. print() 함수를 이용
print(1+1)
# - 2. print() 없이 값 자체를 실행
'Hello'
1+1


# 콘솔창 정리하기
# - 콘트롤 + L

# 작업화면으로 커서복귀
# - 콘트롤 + 1




### 데이터의 자료형
1+1
'1+1'

# - 데이터란 현실 세계에서 관측이 가능한 것들
# : 문자, 숫자(정수), 숫자(실수), 논리값(FALSE, TRUE)
# : NA(Not Avaliable) 결측치
# : NULL 객체 없음


# 1. 문자
# - 작은(혹은 큰) 따옴표 묶인 데이터
'문자데이터'
"문자데이터"
'1+1'
2000+2000

# 2. 숫자
1
2
3.14

# 3. 논리(0, 1)
TRUE
FALSE
T
F


# 기본 연산
# - 사칙연산
1 + 1
2 - 2 
3 * 3
4 / 4

# 실습하기. 7을 3으로 나누어주세요.
7/3

# - 나누기는 몫과 나머지를 같이 구하는 연산

# 몫만 구하는 연산
7 %/% 3

# 나머지만 구하는 연산(MOD)
7 %% 3 


# 연산은 숫자를 대상으로 작동
# - ML에서는 숫자형태만 가능하고, 문자는 무시
1 + 1
'1' + '1'
3.14 - 1.1
TRUE + TRUE








































