# day01_03_basic2.R

# 변수
# - 변수란 변화하는 값을 저장하는 공간
# - 재사용을 목적으로 만듭니다.
# - 영문소문자로만 사용합니다.

a <- 5
a <- 6
1 + a
1 + a
1 + a
1 + a
1 + a



# 변수 생성하는 방법
# 1. R에서 가장 선호하는 방법
a <- 1
a

# 2. 일반적인 프로그래밍에서 가장 선호하는 방법
a = 2
a

# 3. 잘 사용하지 않음
3 -> a
a


# 변수명 규칙
# - 영문소문자로만 만드세요
가 <- 1
#가;


# 실습하기. 현재 날짜를 crr이라는 변수에 저장해주세요
library(lubridate)
crr <- now()
crr


# 변수의 값 변경하기
a
a <- 5
a

# 실습하기. crr에서 현재 월을 조회해주세요
crr
month(crr)

# 실습하기. crr의 월을 2월로 변경해주세요
month(crr) <- 2
crr


# 변수 조회하기
# - 함수를 이용
objects()
ls()

# 변수 초기화
# rm(변수명)
rm(a)

# 모든 변수 초기화
rm(list=ls())



# 함수
# 형태: 영문소문자 ()가 붙은 형태
# - 예약어의 경우 몇 가지 예외가 있습니다.
# 함수란 사전에 미리 정의된 명령어의 집합
# ()안에는 인자값으로 함수로 전달되는 데이터입니다.
# ex) 
# - print(): 값을 출력해라.
# - now(): 현재 날짜를 가져와라.   
# - ls(): 변수를 조회해라.

# 실습하기. 데이터의 타입을 확인해주세요
# - 데이터의 타입을 확인하는 함수 typeof()
# - 'korea' 데이터의 데이터 타입을 확인해주세요.
typeof('korea')
typeof(1)

class('korea')
class(1)

# 함수는 내장 함수, 외장 함수
# - 내장함수: R이 설치되는 시점에 포함된 함수
# - 외장함수: R 설치 이후에 외부에서 설치한 함수
#             혹은 직접 만든 커스텀 함수


# 내장 함수
sum(1, 2, 3, 4, 5)
sum(1:100)

# 최소값
min(1, 2, 3, 4)
min(3, 2, 1, 4)

# 최대값
max(1, 2, 3, 4)

# 실습하기. 1, 2, 3, 4의 평균을 구해주세요
mean(1, 2, 3, 4) # 정상 작동 안 함.
mean(1:4)


# 소수관련 함수
# - 올림
ceiling(5.5)
ceiling(-5.5)

# - 내림
floor(5.5)
floor(-5.5)


# trunc: 버림. 소수점을 버림
trunc(5.5)
trunc(-5.5)


# 반올림: 반올림 5이하는 내림, 5이상은 올림
round(4.65)       # 5
round(4.65, 0)    # 0번째 자리까지 표시해라.
round(4.65, 1)    # 1번째 자리까지 표시해라.
round(4.65, 2)    # 2번째 자리까지 표시해라.

# 유의사항: R은 round함수에서 go to the even digit
# - 짝수값을 취해라의 개념으로 동작함
round(0.5)
round(1.5)
round(2.5)
round(3.5)


# R에서 0을 다루는 방법
# - 0이 4개를 넘어가면 자동으로 지수부로 표시합니다.
10000
100000
5e3
5e10


# 비교연산자
# - 같은가? 다른가? 더 큰가? 크거나 같은가?
# - 무! 조! 건! TRUE, FALSE입니다.
# - =이 현실세계와는 다른 작동을 합니다.
x <- 10
y <- 20

x == y     # 같은가?
10 == 10 
10 > 10
10 >= 10
x > y
x >= y


# 문자로도 가능합니다.
'코리아' == '코리아'

# 유의사항. 다른 자료형으로 연산시에는 조심해야합니다.
1 == '1'
1 == 1
1.1 == '1.1'
# 주의사항. a가 b와 같고, b가 c와 같다면? a는 c와 같다
#  - 자료형이 다른 경우 주의!
1 == TRUE
1 == '1'
TRUE == '1'


# 자료형이 다른 데이터를 비교하는 방법
# - 함수를 이용
class(1) == class('1')
identical(1, '1')
identical(1, 1)







# 논리연산자
# - AND & (두 조건이 모두 참)
T & T
F & T
T & F
F & F
(1 == 1) & (1 == 2)

# - OR |  (하나라도 참이면 참)
T | T
F | T
T | F
F | F
(1 == 1) | (1 == 2)

# - !   (반전, 역)
TRUE
!TRUE




# NA와 NULL
# NA: 값이 빠져있음
# - 데이터가 있지만 빠져있는 경우
# - NA가 포함된 연산에는 NA가 됨
1 + NA
sum(1, 1, NA)
sum(1, 1, NA, na.rm = T) # NA를 제거하고 연산해라


c(1, 2, 3, 4, NA)
mean(c(1, 2, 3, 4, NA))
mean(c(1, 2, 3, 4, NA), na.rm=T)
mean(c(1, 2, 3, 4, NULL))


# NULL: 객체 없음
# - 데이터가 없음
1 + NULL
sum(1, 1, NULL)











