# day02_01_func
## 지난 시간 복습 및 함수

#a   변수
#a() 함수
#a[] 방의 순서가 있다. index가 존재하다.


#()
#[] 리스트, 배열
#{} key와 value의 쌍으로 이루어져있다.

# combine: 결합하다. 인수를 결합하는 함수
# - 결함된 결과가 모두 동일한 자료타입(유형)이 됨
c(1)
c(1, 2, 3)
c(1, 'a', 3)


# 상위 데이터 6개만 보기
1:100
head(1:100)
tail(1:100)


# 랜덤수 
# - 0은 나오지 않고, 1부터 45까지 6개의 수를 추출
sample(45, 6)


# 정렬
sort(sample(45, 6))
# - 실습하기. 정렬을 이용하여 역순정렬(내림차순)으로 만들어주세요.
sort(sample(45, 6), decreasing = TRUE)


# 원소 갯수
length(1:10)





































