# day02_06_vector.R
# 같은 자료형을 가진 스칼라 값들을 순서를 가지고 
# 일렬로 나열한 구조
# 실제로는 세로구조지만 프로그램상에서는 가로로 표시됩니다.
# vector를 만드는 함수는 c()

a <- 1:10
b <- c(1:10)
c <- c(1, 2, 3, 4, 5)

class(a)
class(b)
class(c)

# 순차적인 값을 이용하여 만들기
seq(1, 10) # 1부터 10까지
seq(1, 10, by=3) # 1부터 10까지 증가치는 3


# 반복으로 만들기
# rep(반복할 대상, 회수)
rep(1, 3)   # 1을 3번 반복해라
rep('a', 3) # a를 3번 반복해라

# 실습하기. a, b 를 3회 반복해주세요.
# - rep를 이용해주세요
# a, b, a, b, a, b
c('a', 'b')
rep(c('a', 'b'), 3)


# 다른 자료형이 섞이다면?
c(1, '가', '2', TRUE)


# 벡터의 조회
a <- c('a', 'b', 'c', 'd')
a

# 실습하기. a에서 3번째 방을 조회해주세요
a[3] 

# 실습하기. a에서 1번째, 3번째방을 조회해주세요
#a[1, 3]
c(1, 3)
a[c(1, 3)]

# 벡터에서 여러 건을 동시에 조회하기
1:3
a[1:3] 

# a의 1, 3번째 방을 조회한 이후에 2번째 방을 조회하기
#b <- a[c(1, 3)]
#b[2]
a[c(1, 3)][2]


# 벡터에 이름 붙이기
# - 이름 조회하기
a
names(a) <- '가'
names(a)
# 실습하기. a의 name을 가, 나, 다, 라로 수정해주세요
names(a) <- c('가', '나', '다', '라')
names(a)
a

# a에서 3번째 방 조회하기
a[3]

# 실습하기. a에서 나 방을 조회해주세요
a['나']

# 실습하기. a에서 나, 라 방을 조회해주세요
a[c('나', '라')]


# [], {}, () 구분
# (): 함수를 이용할 때 사용
# - ex) c(), sum(), mean()

# {}: 데이터를 만들 때, key, value라는 쌍(pair)의
#     구조로 데이터를 만듬

# []: 리스트, 배열, 벡터 등 index를 가진 데이터를 만듬
#     index라는 것은 방의 번호



# 벡터 연산에 대한 이해
a <- c(1:6)
a

# 실습하기. a의 모든 방에 +1 연산을 수행해주세요
for(i in a) {
  print(i+1)
}

# 벡터연산
a + 1

# 질문. 다음의 2가지 그룹에서 어떤 그룹이 먼저 작업을 마칠까요?
# 질문문제: 산수문제 1000문제
# - 하버드 박사 졸업생 10명 (CPU)
# - 초등학생 6학년 1000명 (GPU)

a
a + c(1, 2, 3, 4)


# 벡터연산
a + 5
a * 5
a %% 2
a == 2
a >= 2


# a에서 1, 3, 5번째 방을 조회
a[c(1, 3, 5)]
a[c(T, F, T, F, T, F)]
a[c(T, F)]
# 논리값으로 조회할 방을 선택할 수 있음.

# 실습하기. a의 데이터 중 짝수만 보여주세요.
a <- c(2, 1, 3, 5, 4, 6)
a %% 2 == 0
a[a %% 2 == 0]



# 데이터 조작
# - 실습하기. a의 3번째 방의 값을 10으로 변경해주세요
a
a[3] <- 10
a

# 주의사항. 벡터는 단 1개의 데이터만 자료형이 달라져도
#           전체가 영향을 받습니다.
a[3] <- '10'
a
a[3] <- 10
a

# 벡터에 값 추가하기
# - 실습하기. a의 7번째 방에 "추가"을 추가해주세요
a
a[7] <- "추가"
a
























